Ра_новая/src/Documents/НарядНаПроизводство/НарядНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НарядНаПроизводство</name>
  <registerRecords>AccumulationRegister.Материалы</registerRecords>
  <registerRecords>AccumulationRegister.Рулоны</registerRecords>
  <registerRecords>InformationRegister.Наряды</registerRecords>
  <attributes>
    <name>ДатаВыполненияНаряда</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийНачЦеха</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПечати</name>
    <type>
      <types>EnumRef.РежимыПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПечатиРезка</name>
    <type>
      <types>CatalogRef.РежимыПечатиРезка</types>
    </type>
  </attributes>
  <attributes>
    <name>Связан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифЦеха</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническоеЗадание</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>ФЗПцеха</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатериалСписанВКЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеНаряды</name>
    <attributes>
      <name>Наряд</name>
      <type>
        <types>DocumentRef.НарядНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИзрасходованногоМатериала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолИзрасходМатериала_МП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходМатериала</name>
    <attributes>
      <name>КоличествоИзрасходованногоМатериала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЭкземпляров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МатериалОсновы</name>
      <type>
        <types>CatalogRef.МатериалОсновы</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерРулона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Печатник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходМатериала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаРулона</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставБригады</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыРаботников</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФЗП_ПоТарифу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопФЗП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Ра_новая/src/AccumulationRegisters/Материалы/Материалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Материалы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МатериалОсновы</name>
    <type>
      <types>CatalogRef.МатериалОсновы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Ра_новая/src/AccumulationRegisters/Рулоны/Рулоны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Рулоны</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Рулон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МатериалОсновы</name>
    <type>
      <types>CatalogRef.МатериалОсновы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Ра_новая/src/InformationRegisters/Наряды/Наряды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Наряды</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбПлощадьИзрасхМат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбПлощадьИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗатратыНаПрочиеСобМат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗатратыНаМатериал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СвНаряды</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Ра_новая/src/Enums/Статусы/Статусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Статусы</name>
  <enumValues>
    <name>Вработе</name>
  </enumValues>
  <enumValues>
    <name>Готов</name>
  </enumValues>
  <enumValues>
    <name>ДебиторкаПросрочена</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗаполненаСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>НаСогласованииЗаказчика</name>
  </enumValues>
  <enumValues>
    <name>НетДокументов</name>
  </enumValues>
  <enumValues>
    <name>ПеределкаЗаказа</name>
  </enumValues>
  <enumValues>
    <name>Проверен</name>
  </enumValues>
</mdclass:Enum>

Ра_новая/src/Documents/НарядНаПроизводство/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Материалы.Записывать	 	= Истина; 
	Движения.Рулоны.Записывать 			= Истина; 
	Движения.Наряды.Записывать 			= Истина; 
		
	СрЦенаРулона 		= 0;
	ЗатратыНаМатериал	= 0;
	ЗатратыПрочие       = 0;
	ОбщРасходМатериала	= 0;
	ЦенаРулонаПечати    = 0;
	
	ОбПлощадьИзрасхМат 	= ПолучитьОбщПлощадьИзрасхМат();
	ОбКолИзрасхМат 		= ПолучитьОбщКолИзрасхМат();
	
	Для каждого стр из РасходМатериала цикл	
		Если ЗначениеЗаполнено(стр.НомерРулона) Тогда
			структура 	= ОбщегоНазначения.ПолучитьПоРулону(дата-1,стр.НомерРулона);		
			СрЦенаРулона= ОбщегоНазначения.ПолучитьЦенуРулона(стр.НомерРулона,Дата);
			
			СтрукутраДляПроверки = Новый Структура;
			СтрукутраДляПроверки.Вставить("НомерРулона",стр.НомерРулона);
			СтрукутраДляПроверки.Вставить("МатериалОсновы",стр.МатериалОсновы);
			
			Отказ = Не ОбщегоНазначения.ПроверитьМатериалОсновы(СтрукутраДляПроверки);
			Если Отказ Тогда 
				Сообщить(Номер+" Не совпадает материал основы");
			КонецЕсли;
			
			ЗаписьРасходРулона = Движения.Рулоны.Добавить();		
			ЗаписьРасходРулона.Рулон       		= стр.НомерРулона;
			ЗаписьРасходРулона.Материал         = структура.Материал;	
		иначе
			ЗаписьРасходРулона = Движения.Материалы.Добавить();
		КонецЕсли;	
		ЗаписьРасходРулона.Период 			= Ссылка.дата;
		ЗаписьРасходРулона.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		ЗаписьРасходРулона.Количество  		= стр.РасходМатериала;
		ЗаписьРасходРулона.МатериалОсновы	= стр.МатериалОсновы; 
		ЗаписьРасходРулона.Регистратор 		= Ссылка;
		
		Если стр.КоличествоИзрасходованногоМатериала>0 Тогда 
			ЗатратыНаМатериал = ЗатратыНаМатериал+(стр.РасходМатериала*СрЦенаРулона);
			ЦенаРулонаПечати  = СрЦенаРулона; 
		иначе
			ЗатратыПрочие = ЗатратыПрочие+(стр.РасходМатериала*СрЦенаРулона);
		КонецЕсли;
	КонецЦикла;				
	
	ЗаписьНаряда = Движения.Наряды.Добавить();
	ЗаписьНаряда.Период 				= дата;
	ЗаписьНаряда.КодЗаказа     			= номер;
	ЗаписьНаряда.Регистратор 			= Ссылка;
	Если ЗначениеЗаполнено(Ссылка.ТехническоеЗадание) Тогда 
		ЗаписьНаряда.ОбПлощадьИзображения	= Ссылка.ТехническоеЗадание.ОбщаяПлощадьИзображения;
	иначе
		ЗаписьНаряда.ОбПлощадьИзображения	= 0;
	КонецЕсли;	
	
	Если Связан Тогда
		Для Каждого стрСв из СвязанныеНаряды цикл
			ТЧ_РасходМатериала = стрСв.Наряд.РасходМатериала;
			Если ТЧ_РасходМатериала.Количество()>0 Тогда 
				Для Каждого стр из ТЧ_РасходМатериала Цикл 
					Если стр.КоличествоИзрасходованногоМатериала>0 Тогда 
						СрЦенаРулона		= ОбщегоНазначения.ПолучитьЦенуРулона(стр.НомерРулона,Дата);
						ОбщРасходМатериала	= стр.РасходМатериала;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если стрСв.Наряд = Ссылка Тогда
				ЗаписьНаряда.СвНаряды			= ПолучитьСтрСв(Ссылка);
				ЗаписьНаряда.ОбПлощадьИзрасхМат	= стрСв.КоличествоИзрасходованногоМатериала;
				
				Если стрСв.КолИзрасходМатериала_МП=0 Тогда 
					Если стрСв.КоличествоИзрасходованногоМатериала>0 Тогда 
						колИзрасхМатМетрПогон 			= ОбщРасходМатериала*стрСв.КоличествоИзрасходованногоМатериала/ОбПлощадьИзрасхМат;
						стрСв.КолИзрасходМатериала_МП 	= колИзрасхМатМетрПогон;	
					КонецЕсли;										
				КонецЕсли;
				ЗаписьНаряда.ЗатратыНаМатериал = СрЦенаРулона*стрСв.КолИзрасходМатериала_МП;

			КонецЕсли;
		КонецЦикла;
	Иначе
		ЗаписьНаряда.ОбПлощадьИзрасхМат		= ОбПлощадьИзрасхМат;
		ЗаписьНаряда.СвНаряды				= "";
		ЗаписьНаряда.Цена 						= ?(ЦенаРулонаПечати=0,СрЦенаРулона,ЦенаРулонаПечати);
		ЗаписьНаряда.ЗатратыНаМатериал      	= ЗатратыНаМатериал;		
	КонецЕсли;
	
	ЗаписьНаряда.ЗатратыНаПрочиеСобМат  = ЗатратыПрочие;
	ЗаписьНаряда.Цена 					= ?(ЦенаРулонаПечати=0,СрЦенаРулона,ЦенаРулонаПечати);;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Статус = Перечисления.Статусы.Проверен Тогда 
		Если Не РольДоступна("НачальникЦеха") Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле	= "Статус";
			Сообщение.Текст = "Нет прав для установки";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;		
	КонецЕсли;
	ФЗПцеха = СоставБригады.Итог("Итого");
КонецПроцедуры

Функция ПолучитьОбщПлощадьИзрасхМат()
	ОбПлощадьИзрасхМат = 0;
	
	Если Ссылка.Связан Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(НарядНаПроизводствоРасходМатериала.КоличествоИзрасходованногоМатериала, 0) КАК КоличествоИзрасходованногоМатериала
		|ИЗ
		|	Документ.НарядНаПроизводство.РасходМатериала КАК НарядНаПроизводствоРасходМатериала
		|ГДЕ
		|	НарядНаПроизводствоРасходМатериала.Ссылка В(&спНарядов)";
		
		Запрос.УстановитьПараметр("спНарядов", СвязанныеНаряды.Выгрузить(,"Наряд"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбПлощадьИзрасхМат 	= ОбПлощадьИзрасхМат+ВыборкаДетальныеЗаписи.КоличествоИзрасходованногоМатериала; 
		КонецЦикла;		
	Иначе 
		ОбПлощадьИзрасхМат 	= РасходМатериала.Итог("КоличествоИзрасходованногоМатериала");
	КонецЕсли;	
	
	Возврат ОбПлощадьИзрасхМат;
КонецФункции	
	
Функция ПолучитьОбщКолИзрасхМат()
	ОбКолИзрасхМат = 0;
	
	Если Ссылка.Связан Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НарядНаПроизводствоРасходМатериала.НомерРулона КАК НомерРулона,
		|	НарядНаПроизводствоРасходМатериала.РасходМатериала КАК РасходМатериала
		|ИЗ
		|	Документ.НарядНаПроизводство.РасходМатериала КАК НарядНаПроизводствоРасходМатериала
		|ГДЕ
		|	НарядНаПроизводствоРасходМатериала.Ссылка В(&спНарядов)
		|	И НарядНаПроизводствоРасходМатериала.КоличествоИзрасходованногоМатериала > 0";
		
		Запрос.УстановитьПараметр("спНарядов", СвязанныеНаряды.Выгрузить(,"Наряд"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбКолИзрасхМат 	= ОбКолИзрасхМат+ВыборкаДетальныеЗаписи.РасходМатериала; 
		КонецЦикла;	
	Иначе 
		ОбКолИзрасхМат 		= РасходМатериала.Итог("РасходМатериала");
	КонецЕсли;	
	
	Возврат ОбКолИзрасхМат;
КонецФункции	
	
Функция ПолучитьСтрСв(Ссылка)
	
	 СвНаряды="";
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	НарядНаПроизводствоСвязанныеНаряды.Наряд.Номер
	 |ИЗ
	 |	Документ.НарядНаПроизводство.СвязанныеНаряды КАК НарядНаПроизводствоСвязанныеНаряды
	 |ГДЕ
	 |	НарядНаПроизводствоСвязанныеНаряды.Ссылка = &Ссылка
	 |	И НарядНаПроизводствоСвязанныеНаряды.Наряд.Ссылка <> &Ссылка";
	 
	 Запрос.УстановитьПараметр("Ссылка", ссылка);
	 
	 Результат = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = Результат.Выбрать();
	 
	 СвНаряды = "";
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 Если СвНаряды="" Тогда 
			 СвНаряды = СвНаряды+ВыборкаДетальныеЗаписи.НарядНомер;
		 Иначе
			 СвНаряды = СвНаряды+", "+ВыборкаДетальныеЗаписи.НарядНомер;
		 КонецЕсли;
	 КонецЦикла;
	 
	
	Возврат СвНаряды;
КонецФункции
